arturritzel/micros-STM32F4/introducao/brincando com timer/exercicios/ex4.c
#include "stm32f4xx.h"

/*
 * timer 10: ira trabalhar com altas frequencias
 * psc arbitrado: 160
 *
 * timer 11: ira trabalhar com baixas frequencias
 * psc arbitrado: 16000
 */

int calculaArrEmFreq(float freq, float presc){
	float tempo = (1/freq)/2;
	return tempo*16000000/(presc+1);
}

void liga(int pino){ // funcao liga pino x (numero 1 a 8)
	switch(pino){
	case 1:
		GPIOB->ODR|=0x00000002;  // liga o pino 1;
		break;
	case 2:
		GPIOB->ODR|=0x00000004;  // liga o pino 2;
		break;
	case 3:
		GPIOB->ODR|=0x00000008;  // liga o pino 3;
		break;
	case 4:
		GPIOB->ODR|=0x00000020;  // liga o pino 5;
		break;
	case 5:
		GPIOB->ODR|=0x00001000;  // liga o pino 12;
		break;
	case 6:
		GPIOB->ODR|=0x00002000;  // liga o pino 13;
		break;
	case 7:
		GPIOB->ODR|=0x00004000;  // liga o pino 14;
		break;
	case 8:
		GPIOB->ODR|=0x00008000;  // liga o pino 15;
		break;
	}
}

void desliga(int pino){ // funcao desliga pino x (numero 1 a 8)
	switch(pino){
	case 1:
		GPIOB->ODR&=~0x00000002;  // desliga o pino 1;
		break;
	case 2:
		GPIOB->ODR&=~0x00000004;  // desliga o pino 2;
		break;
	case 3:
		GPIOB->ODR&=~0x00000008;  // desliga o pino 3;
		break;
	case 4:
		GPIOB->ODR&=~0x00000020;  // desliga o pino 5;
		break;
	case 5:
		GPIOB->ODR&=~0x00001000;  // desliga o pino 12;
		break;
	case 6:
		GPIOB->ODR&=~0x00002000;  // desliga o pino 13;
		break;
	case 7:
		GPIOB->ODR&=~0x00004000;  // desliga o pino 14;
		break;
	case 8:
		GPIOB->ODR&=~0x00008000;  // desliga o pino 15;
		break;
	}
}

int main(void)
{
	RCC->AHB1ENR=0x00000087;
	GPIOA->MODER=0x28000000;  // inicializa o modo debugger para a interface do ARM
	GPIOB->MODER=0x55000454;  // configura os pinos B1, B2, B3, B5, B12, B13, B14 e B15 com a função de saída
	GPIOC->MODER=0x00000000;  // configura os pinos C com função de entrada

	RCC->APB2ENR|=0x20000;
	RCC->APB2ENR|=0x40000;

	TIM10->PSC=159;
	TIM10->CR1=0x05;
	//TIM10->ARR=calculaArrEmFreq(5, TIM10->PSC);

	TIM11->PSC=15999;
	TIM11->CR1=0x05;
	//TIM11->ARR=calculaArrEmFreq(5, TIM11->PSC);
	TIM11->ARR=100;

	while (1){

		// 1 ciclo = 0,1s, então 1,4s = 14 ciclos
		for(int i = 0; i < 16; i++){
			if(i == 0){ desliga(5); liga(3); liga(8); } // liga verde 1 e vermelho 2, desliga vermelho 1
			if(i == 5) liga(4); // liga amarelo 1
			if(i == 7){ desliga(3); desliga(4); liga(5); } // desliga verde 1, amarelo 1, liga vermelho 1

			if(i == 8){desliga(8); liga(6);} // desliga vermelho 2, liga verde 2
			if(i == 13) liga(7); // liga amarelo 2
			if(i == 15){ desliga(6); desliga(7); liga(8); } // desliga verde 2, amarelo 2, liga vermelho 2

			while((TIM11->SR&0x01) == 0x00);
			TIM11->SR&=~(0x01);

		}

	}
}
